
Задача 2: Найдите сумму цифр трехзначного числа.

            *Пример:*

            123 -> 6 (1 + 2 + 3)
            100 -> 1 (1 + 0 + 0) |
number = input ("Введите трехзначное число")
number = int(number)
s = number%10
n = number//100

m =  number//10%10

print(m+s+n)
#==============

Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они 
сделали S журавликов. Сколько журавликов сделал каждый ребенок, если 
известно, что Петя и Сережа сделали одинаковое количество журавликов, 
а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

*Пример:*

6 -> 1  4  1
24 -> 4  16  4
   60 -> 10  40  10
s = input ("Введите ")
s = int(s)
x = s/6 

serz = x
petr = x
kat = (x+x)*2
print(serz)
print(petr)
print(kat)
#=====================================
Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы 
расплачивались за проезд и получали билет с номером. Счастливым 
билетом называют такой билет с шестизначным номером, где сумма первых 
трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – 
счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая 
проверяет счастливость билета.

*Пример:*

385916 -> yes
123456 -> no

n = input("Введите шестизначное число: ")
n = int(n)
a1 = n % 10 
a2 = n//10%10
a3 = n//100%10
a4 = n//1000%10
a5 = n//10000%10
a6 = n//100000%10
if a1+a2+a3==a4+a5+a6:
    print("YES")
else:
    print("NO")
#===============================
Задача 8: Требуется определить, можно ли от шоколадки размером 
n × m долек отломить k долек, если разрешается сделать один разлом 
по прямой между дольками (то есть разломить шоколадку на два 
прямоугольника).

*Пример:*

3 2 4 -> yes
3 2 1 -> no
n = input("Введите ширину шоколадки: ")
n = int(n)
m = input("Введите длинну шоколадки: ")
m = int(m)
k = input("Введите длинну шоколадки: ")
k = int(k)
if k < n*m and (k%m == 0 or k%n == 0):
    print("YES")

else:
    print("NO")    
