#Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой,
#а некоторые – гербом. Определите минимальное число монеток, которые 
#нужно перевернуть, чтобы все монетки были повернуты вверх одной и той 
#же стороной. Выведите минимальное количество монет, которые нужно 
#перевернуть
n = int(input())
k = 0
for i in range(n):
    v = int(input())
    if v == 1:
        k += 1
print(k if k<n/2 else n-k)
#Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – 
#школьница. Петя помогает Кате по математике. Он задумывает два 
#натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для 
#этого Петя делает две подсказки. Он называет сумму этих чисел S и их 
#произведение P. Помогите Кате отгадать задуманные Петей числа.

x = int(input("число x: "))
y = int(input("число y: "))
 
p = x * y
s = x + y
x2 = int((s-((-s)**2-4*p)**0.5)/2)
y2 = int((s+((-s)**2-4*p)**0.5)/2)
print(x2, y2)

#Задача 14: Требуется вывести все целые степени двойки (т.е. числа 
#вида 2k), не превосходящие числа N.

n = int(input("введите число n: "))
k = 1
p = 1
while k <= n:
    if k > 0:

        p = p * 2
        k += 1
print(p)    
    
